import os

from dotenv import load_dotenv

load_dotenv()

TOKEN = os.getenv("TOKEN")
DOWNLOADS_DIR = 'downloads'
Messages = {
    'WELCOME': "Посчитаю твое EV БЕСплатно, без СМС и регистрации \n" \
              + "отправь файл с хистори, /help для справки",
    'HELP': "Отправь 1 (пока только один) файл с рукой полученной из конвертора hand-proc",
    'SCREEN':  "Отправь скрин из ХМ3 с корректным расчетом please",
    'GOT_FEEDBACK':  "молодец, иди катай",
    'ASK_FEEDBACK':  "Чё с EVхой бро?)",
    'GOT_FILE':  "got file",
    'WRONG_DOC': "wrong file type"
}

Answers = {
    'CORRECT': "огонь, пойду катну!",
    'WRONG': "чё за х!@#я?, прога гавно!",
}

BI_2_PRIZE = {
    'chip': ((1, )),
    527.16: (0.498, 0.498, 0.0041),
    266.64: (0.4969, 0.4969, 0.0062),
    131.79: ((1, )),
    107.84: (0.4984, 0.4984, 0.0032),
    66.66: ((1, )),
    58.84: (0.4631, 0.4631, 0.0738),
    43.16: (0.475, 0.475, 0.05),
    29.44: (0.4671, 0.4671, 0.0659),
    26.96: ((1, )),
    22.36: (0.4919, 0.4919, 0.0136),
    17.28: (0.4774, 0.4774, 0.0451),
    14.71: ((1, )),
    10.79: ((1, )),
    7.5: (0.4774, 0.4774, 0.0451),
    7.36: ((1, )),
    5.59: ((1, )),
    4.32: ((1, )),
    2.76: ((1, )),
    2.16: ((1, )),
}

